[
  {
    "headline": "Android Development: Getting Started",
    "image_url": "http://s01.shiftdelete.net/img/general_b/14-06/21/android-1.jpg",
    "author_name": "Google",
    "published_date": "Dec 03, 2016",
    "article": "Welcome to Training for Android developers. Here you'll find training classes that describe how to accomplish a specific task with code samples you can re-use in your app. Classes are organized into several groups you can see at the top-level of the left navigation.\nThe first training guides below teach you the essentials for Android app development. If you're a new Android app developer, you should complete each of these classes in order.\nVarious online video courses are also available if you'd prefer an interactive video experience."
  },
  {
    "headline": "WHY PYTHON FOR BIG DATA?",
    "image_url": "http://www.pixelstech.net/article/images/Python.png",
    "author_name": "Anaconda",
    "published_date": "Mar 26, 2010",
    "article": "Python is a powerful, flexible, open source language that is easy to learn, easy to use, and has powerful libraries for data manipulation and analysis. Its simple syntax is very accessible to programming novices, and will look familiar to anyone with experience in Matlab, C/C++, Java, or Visual Basic. Python has a unique combination of being both a capable general-purpose programming language as well as being easy to use for analytical and quantitative computing.\nFor over a decade, Python has been used in scientific computing and highly quantitative domains such as finance, oil and gas, physics, and signal processing. It has been used to improve Space Shuttle mission design, process images from the Hubble Space Telescope, and was instrumental in orchestrating the physics experiments which led to the discovery of the Higgs Boson (the so-called \"God particle\").\nAt the same time, Python has been used to build massively scalable web applications like YouTube, and has powered much of Google's internal infrastructure. Companies like Disney, Sony Dreamworks, and Lucasfilm ILM rely heavily on Python to coordinate massive clusters of computer graphics servers to produce the imagery for blockbuster movies. According to the TIOBE index, Python is one of the most popular programming languages in the world, ranking higher than Perl, Ruby, and JavaScript by a wide margin."
  }
]